---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalFileReferenceType.AssemblyCodeTable
enum: Autodesk.Revit.DB.ExternalFileReferenceType
source: html/4ccfe92f-71d9-e9d6-c308-5a178186837b.htm
---
# Autodesk.Revit.DB.ExternalFileReferenceType.AssemblyCodeTable

The assembly code table (The file which contains assembly code information.)